Extensions/ИнтеграцияGreenApi/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Заявка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>омг_БезЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НесколькоСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_БезЗаписиНесколькоВрачей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ВремяПодтвержденияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ВремяПодтвержденияЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереносПодтверждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_РаботыСФиксированнымВременемЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_РаботыСФиксированнымВременемЗаписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ВидыПредопределенныхШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ВидыПредопределенныхШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьСПодробностями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьБезПодробностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеОЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтменеБезОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическоеСообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ШаблоныСообщений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяКнопки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_КатегорииШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСодержимого</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыСодержимогоШаблона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальнаяМетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_СпециальныеМетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодготовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКодПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Кнопки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.iga_ТипыКнопокСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрКнопки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_ПодразделенияОператоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИсточник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Documents/Заявка/Ext/ManagerModule.bsl
Процедура ЗаписатьОповещениеПоВремени(НаборЗаписей, ЗанятыеДаты, ЧатСсылка, Заявка, Знач ДатаНачала, ТекущаяДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Ссылка КАК Ссылка,
	               |	iga_ВремяПодтвержденияЗаявок.Время КАК Время,
	               |	iga_ВремяПодтвержденияЗаявок.ПереносПодтверждения КАК ПереносПодтверждения
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_ВремяПодтвержденияЗаявок КАК iga_ВремяПодтвержденияЗаявок
	               |		ПО Заявка.Филиал = iga_ВремяПодтвержденияЗаявок.Филиал
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	ВыборкаВремени = Запрос.Выполнить().Выбрать();
	ВремяОповещения = Дата(1,1,1,17,0,0);
	ПереносПодтверждения = Ложь;
	Если ВыборкаВремени.Следующий() Тогда
		ВремяОповещения = ВыборкаВремени.Время;
		ПереносПодтверждения = ВыборкаВремени.ПереносПодтверждения;
	КонецЕсли;      
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_РаботыСФиксированнымВременемЗаписи.Работа КАК Работа,
	               |	iga_РаботыСФиксированнымВременемЗаписи.Время КАК Время
	               |ИЗ
	               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |		ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				ИЛИ (ЗаявкаРаботы.Сотрудник = iga_РаботыСФиксированнымВременемЗаписи.Врач
	               |					ИЛИ ЗаявкаРаботы.Ссылка.Сотрудник = iga_РаботыСФиксированнымВременемЗаписи.Врач)
	               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка";
	ВыборкаФиксВремени = Запрос.Выполнить().Выбрать();
	Если ВыборкаФиксВремени.Следующий() Тогда
		ДатаНачала = НачалоДня(ДатаНачала) + (ВыборкаФиксВремени.Время - Дата(1,1,1));
	КонецЕсли;
	
		ДатаДокумента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заявка, "Дата");
		
		КоличествоЧасов = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ТекущаяДата, ДатаНачала, "ЧАС");
		
		Язык = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык");
				
		Более24 = Ложь;
		Более12 = Ложь;
		Более3 = Ложь;
		МинусЧасов = 0;
		
		Если КоличествоЧасов > 3 Тогда
			Более3 = Истина
		КонецЕсли;
		Если КоличествоЧасов > 12 Тогда
			МинусЧасов = -12;
			Более12 = Истина;
		КонецЕсли;

		//Если КоличествоЧасов > 24 Тогда
		//	МинусЧасов = -24;
		//	Более24 = Истина;
		//КонецЕсли;
		
		
		Если (Более24 Или Более12) 
			И ?(День(ДатаДокумента) + 1 = День(ДатаНачала), Час(ДатаДокумента) < 17, Истина) Тогда

			ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаНачала, "ЧАС", МинусЧасов);
			
			Если Час(ДатаОповещения) >= 0 И Час(ДатаОповещения) < 7 Тогда
				ДатаОповещения = НачалоДня(НачалоДня(ДатаОповещения)-1) + (ВремяОповещения - Дата(1,1,1));
			ИначеЕсли ДатаОповещения - НачалоДня(ДатаОповещения) > (ВремяОповещения - Дата(1,1,1)) И Час(ДатаОповещения) <= 23 Тогда
				ДатаОповещения = НачалоДня(ДатаОповещения) + (ВремяОповещения - Дата(1,1,1));
			КонецЕсли;       
			
			
			Если ПереносПодтверждения 
				И ДеньНедели(ДатаОповещения) = 7 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаОповещения, "ДЕНЬ", -2);
			КонецЕсли;
			
			
			Если ЗанятыеДаты.Найти(ДатаОповещения) = Неопределено И ДатаОповещения > ТекущаяДата() Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Заявка = Заявка;
				Запись.ДатаОповещения = ДатаОповещения;
				Запись.ТребуетсяПодтверждение = Истина;
				Запись.ДатаЗаписи = ДатаНачала;
				Запись.Чат = ЧатСсылка; 
				ЗанятыеДаты.Добавить(ДатаОповещения);
				Запись.ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(
					Перечисления.iga_ВидыПредопределенныхШаблонов.ПодтверждениеЗаписи, Язык);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Более3 Тогда

			ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаНачала, "ЧАС", -3);

			Если Час(ДатаОповещения) >= 0 И Час(ДатаОповещения) < 6 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ДатаОповещения), "ЧАС", 6);
			ИначеЕсли Час(ДатаОповещения) > 20 И Час(ДатаОповещения) <=23 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ДатаОповещения), "ЧАС", 20);
			КонецЕсли;
			
			Если ЗанятыеДаты.Найти(ДатаОповещения) = Неопределено Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Заявка = Заявка;
				Запись.ДатаОповещения = ДатаОповещения;
				Запись.ДатаЗаписи = ДатаНачала;
				Запись.Чат = ЧатСсылка;
				ЗанятыеДаты.Добавить(ДатаОповещения);
				Запись.ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(
					Перечисления.iga_ВидыПредопределенныхШаблонов.ОповещениеОЗаписи, Язык);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецПроцедуры
